#include "stdio.h"

int main()
{
	int T = 0, a = 0, b = 0, c = 0, d = 0, R = 100;
	for (a = 0; a <= 2; a++) {// для  записи for действует правило (Инициализация; Условие; Модификация)//
		for (b = 0; b <= 5; b++) {
			for (c = 0; c <= 20; c++) {
				for (d = 0; d <= 50; d++) {
					if (R == (a * 50 + b * 20 + c * 5 + d * 2))
						T++;//Что бы сумма копеек была 100,  монет по 50 должно быть не больше 2, 20 не больше 5 и так далее//
				}
			}
		}
	}
	printf("Methods of recruitment - %d\n", T);
	getchar();
}
